---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.SimpleLine
source: html/462b2fbb-597c-c17b-dc80-0ff74c690b83.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.SimpleLine Property

Check whether this shape consists of a single straight segment, possibly with hooks.

## Syntax (C#)
```csharp
public bool SimpleLine { get; }
```